notes/clojure.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clojure</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Clojure</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgea89682">clj vs clojure</a></li>
<li><a href="#org1f72596">Cmd Execution and REPL</a></li>
<li><a href="#orgbde8224">Project Creation</a>
<ul>
<li><a href="#org8600745">Minimal command line</a></li>
<li><a href="#orgf127283">Using clj-new</a></li>
</ul>
</li>
<li><a href="#org4e27597">Emacs Cider</a></li>
<li><a href="#orgdc27988">Testing</a>
<ul>
<li><a href="#org6dc21a4">Run all tests in namespace</a></li>
<li><a href="#org19ee05b">Run a single test</a></li>
</ul>
</li>
<li><a href="#orga73092b">Symbols vs Keywords</a></li>
<li><a href="#orge78150e">How to (+ 1 2)</a></li>
<li><a href="#org57f0f3c">core.async</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgea89682" class="outline-2">
<h2 id="orgea89682"><a href="#orgea89682">clj vs clojure</a></h2>
<div class="outline-text-2" id="text-orgea89682">
<p>
<code>clj</code> is just a program that wraps <code>clojure</code> with <code>readline</code> support.
</p>

<div class="org-src-container">
<pre class="src src-bash">cat $(which clj) | grep exec
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
exec rlwrap -r -q '\"' -b "(){}[],^%#@\";:'" "$bin_dir/clojure" "$@"
</pre>


<p>
<code>readline</code> provides support for editing a command in the terminal (e.g. using
arrow keys for moving around within the command, using <code>C-a</code> <code>C-e</code> <code>C-f</code> <code>C-b</code>
movement commands) and stuff like that.
</p>

<p>
So, <code>clj</code> just provides better interactivity in the REPL. As an end user, you
might as well just use <code>clj</code> for everything.
</p>
</div>
</div>

<div id="outline-container-org1f72596" class="outline-2">
<h2 id="org1f72596"><a href="#org1f72596">Cmd Execution and REPL</a></h2>
<div class="outline-text-2" id="text-org1f72596">
<p>
Call a function
</p>

<div class="org-src-container">
<pre class="src src-sh">clj -X $<span style="color: #dcaeea;">nsname</span>/$<span style="color: #dcaeea;">funcname</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
Hello world, the time is 10:00 AM
</pre>


<p>
Start a REPL that I can attach to from Emacs.
</p>

<div class="org-src-container">
<pre class="src src-sh">clj -Sdeps <span style="color: #98be65;">'{:deps {cider/cider-nrepl {:mvn/version "RELEASE"}}}'</span> <span style="color: #98be65;">\</span>
    -m nrepl.cmdline <span style="color: #98be65;">\</span>
    --middleware <span style="color: #98be65;">"[cider.nrepl/cider-middleware]"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbde8224" class="outline-2">
<h2 id="orgbde8224"><a href="#orgbde8224">Project Creation</a></h2>
<div class="outline-text-2" id="text-orgbde8224">
</div>
<div id="outline-container-org8600745" class="outline-3">
<h3 id="org8600745"><a href="#org8600745">Minimal command line</a></h3>
<div class="outline-text-3" id="text-org8600745">
<p>
All you need is a project directory with a
</p>

<ol class="org-ol">
<li><code>deps.edn</code></li>
<li><code>src/foo.clj</code></li>
</ol>

<p>
However it should be namespaced properly (TODO: work on this).
</p>

<div class="org-src-container">
<pre class="src src-sh">touch $<span style="color: #dcaeea;">d</span>/deps.edn $<span style="color: #dcaeea;">d</span>/src/core.clj
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"{:deps {org.clojure/clojure {:mvn/version \"RELEASE\"}}}"</span> &gt; $<span style="color: #dcaeea;">d</span>/deps.edn
<span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"(ns core) (defn -main [] (println \"hello world\"))"</span> &gt;&gt; src/core.clj
clj -m core
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf127283" class="outline-3">
<h3 id="orgf127283"><a href="#orgf127283">Using clj-new</a></h3>
<div class="outline-text-3" id="text-orgf127283">
<p>
The following makes use of an alias defined in <code>~/.clojure/deps.edn</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">clj -X:new-app :name cfclrk/$<span style="color: #dcaeea;">projectName</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4e27597" class="outline-2">
<h2 id="org4e27597"><a href="#org4e27597">Emacs Cider</a></h2>
<div class="outline-text-2" id="text-org4e27597">
<p>
Basic workflow is described <a href="https://docs.cider.mx/cider/usage/cider_mode.html#basic-workflow">in the cider docs here</a>.
</p>

<ul class="org-ul">
<li>Open a file at the root dir of the project</li>
<li><code>M-x cider-jack-in</code></li>
<li>Open a file in the project, and <code>C-c C-k</code> (<code>cider-load-buffer</code>)</li>
<li>In the <code>*cider-repl</code> buffer, you know call the fully-qualified functions in
that file. Or, <code>(in-ns &lt;ns-name&gt;)</code> to call functions in that file without
namespace qualification.</li>
<li>Edit a function, and <code>C-c C-e</code> on that function to reload it.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc27988" class="outline-2">
<h2 id="orgdc27988"><a href="#orgdc27988">Testing</a></h2>
<div class="outline-text-2" id="text-orgdc27988">
<p>
Use test-runner, which handles test discovery and running tests.
<a href="https://github.com/cognitect-labs/test-runner">https://github.com/cognitect-labs/test-runner</a>
</p>
</div>

<div id="outline-container-org6dc21a4" class="outline-3">
<h3 id="org6dc21a4"><a href="#org6dc21a4">Run all tests in namespace</a></h3>
<div class="outline-text-3" id="text-org6dc21a4">
<div class="org-src-container">
<pre class="src src-sh">clj -A:test -n cfclrk.sicp-test
</pre>
</div>
</div>
</div>

<div id="outline-container-org19ee05b" class="outline-3">
<h3 id="org19ee05b"><a href="#org19ee05b">Run a single test</a></h3>
<div class="outline-text-3" id="text-org19ee05b">
<div class="org-src-container">
<pre class="src src-sh">clj -A:test -v cfclrk.sicp-test/a-test
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga73092b" class="outline-2">
<h2 id="orga73092b"><a href="#orga73092b">Symbols vs Keywords</a></h2>
<div class="outline-text-2" id="text-orga73092b">
<p>
What's the difference between a symbol and a keyword?
</p>

<p>
Excerpt from "Clojure in Action, Second Edition" by Amit Rathore Francis
Avila:
</p>

<blockquote>
<p>
Essetially what's happening when you quote a symbol is you’re treating the
symbol as data and not code. In practice you’ll almost never quote symbols to
use them as data because Clojure has a special type specifically for this use
case: the keyword. A keyword is sort of like an autoquoted symbol: keywords
never reference some other value and always evaluate to themselves. Keyword
syntax is almost like symbol syntax, except keywords always begin with a
colon.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge78150e" class="outline-2">
<h2 id="orge78150e"><a href="#orge78150e">How to (+ 1 2)</a></h2>
<div class="outline-text-2" id="text-orge78150e">
<p>
A few ways to add 1 and 2, in increasing complexity.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #51afef;">(</span>+ 1 2<span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
3
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #51afef;">(</span>apply + <span style="color: #c678dd;">[</span>1 2<span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
3
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #51afef;">(</span>reduce + <span style="color: #c678dd;">[</span>1 2<span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
3
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #51afef;">(</span>reduce <span style="color: #c678dd;">(</span><span style="color: #51afef;">fn</span> <span style="color: #98be65;">[</span>acc i<span style="color: #98be65;">]</span> <span style="color: #98be65;">(</span>+ acc i<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">[</span>1 2<span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
3
</pre>
</div>
</div>

<div id="outline-container-org57f0f3c" class="outline-2">
<h2 id="org57f0f3c"><a href="#org57f0f3c">core.async</a></h2>
<div class="outline-text-2" id="text-org57f0f3c">
<p>
There are some great examples from O'Reilly <a href="https://resources.oreilly.com/examples/0636920041474/">here</a>, which is supplemental
content for their excellent video course <a href="https://learning.oreilly.com/videos/communicating-sequential-processes/9781771374293/">Communicating Sequential Processes
with core.async</a>.
</p>
</div>
</div>
</div>
</body>
</html>
